// pages/center/about/about.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    content: "    为满足隆回县人才信息管理与服务需求，“智汇隆回”人才信息管理系统采用微信小程序设计模式、B/S架构和JAVA Web开发技术，利用大数据智能处理和数据可视化技术，为隆回县企事业单位提供一个高效发布用人招聘信息、人才培训信息和采集人才信息的平台。\n",

    info: "\n    本微信小程序需要的功能是个人用户信息填写，企业用户信息填写,查看信息等。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})