// pages/center/about/about.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    content: "    “智汇隆回” 微信小程序是为隆回县政企事业单位和各类专业人才提供信息服务的官方平台，主要功能包括人才信息采集、人才需求信息发布等。\n",

    info: "\n    本平台由隆回县委组织部负责运行和管理。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})